In [4]:

import pandas as pd

In [6]:
df=pd.read_csv("Layer_10m_depth.csv")

In [14]:
df.head()
df.columns
df["Y_UTM46N"]

0      2775140.834
1      2734782.458
2      2750145.304
3      2717196.741
4      2741099.129
          ...
125    2664578.186
126    2634502.933
127    2633122.210
128    2681595.667
129    2787516.569
Name: Y_UTM46N, Length: 130, dtype: float64

<h1>Giving dataframe/variable</h1>

In [28]:
#this gives data from one dataframe to another dataframe/variable
a=['StationID']
b=['Lithology','Name']
nishma=df[b]
karki=df[a]

<h2>joining two dataframe</h2>

In [35]:
nishmakarki=pd.concat([karki,nishma],axis=1)
nishmakarki

     StationID  Lithology         Name
0       400005          1        BWDB6
1       400006          1        BWDB7
2       400007          1        BWDB8
3       400008          1        BWDB9
4       400009          1       BWDB10
..         ...        ...          ...
125     612661          1      Pabna-3
126     612715          1    Rajbari-3
127     612778          1    Rajbari-3
128     612833          1  Sirajganj-1
129     981134          1    GA3230001

[130 rows x 3 columns]

<h2>Giving dataframe/variable:2nd trial</h2>

In [36]:
a=['StationID']
b=['Name','Lithology','X_UTM46N','Y_UTM46N']
display1=df[a]
display2=df[b]
display=pd.concat([display1,display2],axis=1)
display

     StationID         Name  Lithology      X_UTM46N     Y_UTM46N
0       400005        BWDB6          1  109756.09810  2775140.834
1       400006        BWDB7          1  149159.72680  2734782.458
2       400007        BWDB8          1   99870.96983  2750145.304
3       400008        BWDB9          1  169009.16110  2717196.741
4       400009       BWDB10          1  137218.65940  2741099.129
..         ...          ...        ...           ...          ...
125     612661      Pabna-3          1  150491.64070  2664578.186
126     612715    Rajbari-3          1  154421.60070  2634502.933
127     612778    Rajbari-3          1  159896.07590  2633122.210
128     612833  Sirajganj-1          1  166014.00560  2681595.667
129     981134    GA3230001          1  137043.36690  2787516.569

[130 rows x 5 columns]

AttributeError: 'int' object has no attribute 'columns'

<h1>new topic</h1>